## Staging: ses_receiving_emails
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                            NAME                                             |
|--------|---------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.ses_receiving_emails-500-errors-api`                      |
|        | `aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_receiving_emails-api`    |
|        | `aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_receiving_emails-api` |
|        | `aws_lambda_permission.ses_receiving_emails`                                                |
|        | `module.ses_receiving_emails.aws_cloudwatch_log_group.this`                                 |
|        | `module.ses_receiving_emails.aws_lambda_function.this`                                      |
| update | `aws_ecr_repository.ses_receiving_emails`                                                   |
|        | `module.ses_receiving_emails.aws_iam_policy.non_vpc_policies[0]`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.ses_receiving_emails-500-errors-api will be created
  + resource "aws_cloudwatch_log_metric_filter" "ses_receiving_emails-500-errors-api" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ses_receiving_emails"
      + name           = "ses_receiving_emails-500-errors-api"
      + pattern        = "\"\\\"levelname\\\": \\\"ERROR\\\"\""

      + metric_transformation {
          + name      = "500-errors-ses_receiving_emails-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_receiving_emails-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-ses_receiving_emails-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:239043911459:alert-warning-us-east-1",
        ]
      + alarm_description                     = "One 500 error in 1 minute for ses_receiving_emails api"
      + alarm_name                            = "logs-1-500-error-1-minute-warning-ses_receiving_emails-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-ses_receiving_emails-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:239043911459:alert-ok-us-east-1",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_receiving_emails-api will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-ses_receiving_emails-api" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:239043911459:alert-critical-us-east-1",
        ]
      + alarm_description                     = "Ten 500 errors in 5 minutes for ses_receiving_emails api"
      + alarm_name                            = "logs-10-500-error-5-minutes-critical-ses_receiving_emails-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-ses_receiving_emails-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:239043911459:alert-ok-us-east-1",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_ecr_repository.ses_receiving_emails will be updated in-place
  ~ resource "aws_ecr_repository" "ses_receiving_emails" {
        id                   = "notify/ses_receiving_emails"
        name                 = "notify/ses_receiving_emails"
        tags                 = {}
        # (5 unchanged attributes hidden)


      ~ image_scanning_configuration {
          ~ scan_on_push = false -> true
        }
        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.ses_receiving_emails will be created
  + resource "aws_lambda_permission" "ses_receiving_emails" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ses_receiving_emails"
      + id                  = (known after apply)
      + principal           = "ses.amazonaws.com"
      + source_account      = "239043911459"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.ses_receiving_emails.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/ses_receiving_emails"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.ses_receiving_emails.aws_iam_policy.non_vpc_policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "non_vpc_policies" {
        id        = "arn:aws:iam::239043911459:policy/ses_receiving_emails_non_vpc"
        name      = "ses_receiving_emails_non_vpc"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "CloudWatchAccess"
                    },
                  ~ {
                      ~ Resource = "arn:aws:ecr:us-east-1:239043911459:repository/notify/ses_receiving_emails" -> "arn:aws:ecr:ca-central-1:239043911459:repository/notify/ses_receiving_emails"
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ses_receiving_emails.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + function_name                  = "ses_receiving_emails"
      + id                             = (known after apply)
      + image_uri                      = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/ses_receiving_emails:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::239043911459:role/ses_receiving_emails"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CELERY_QUEUE_PREFIX"     = "eks-notification-canada-ca"
              + "GC_NOTIFY_SERVICE_EMAIL" = "gc.notify.notification.gc@staging.notification.cdssandbox.xyz"
              + "NOTIFY_SENDING_DOMAIN"   = "staging.notification.cdssandbox.xyz"
              + "SQS_REGION"              = "ca-central-1"
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ lambda_ses_receiving_emails_image_arn = "arn:aws:lambda:us-east-1:239043911459:function:ses_receiving_emails" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_receiving_emails-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_receiving_emails-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_receiving_emails"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
